[
    {
        "title": "Act 1: The Nebula's Embrace",
        "encounters": [
            {
                "id": "act1_enc1",
                "image": "encounters/act1_enc1.png",
                "scenario": "Deep within the nebula, your ship's energy readings flicker erratically. A massive, crystalline organism, dormant for millennia, has subtly integrated itself with the nebula's energy currents, causing interference. It appears harmless, but its presence is disrupting your navigation systems.",
                "options": [
                    {
                            "text": "Attempt to safely reroute power around the interference, trusting Zephyr's nuanced understanding of energy flow.",
                            "outcome": {
                            "text": "Zephyr meticulously reconfigures the energy conduits, isolating your systems from the organism's influence. The disruption ceases, and your navigation is restored. You also discover a unique resonant frequency within the creature that subtly boosts your shield's output for a short duration.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "specialEffect": "shipShieldBoost"
                        }
                    },
                    {
                        "text": "Have Jax rig a powerful, localized energy burst to disrupt the organism's interference directly.",
                        "outcome": {
                            "text": "Jax deploys a makeshift energy pulse, which indeed shatters the creature's crystalline structure, clearing the interference. However, the raw energy feedback overloads a minor subsystem, requiring immediate repairs and causing minor damage.",
                            "shipHealthChange": -5,
                            "treasureChange": 0,
                            "crewHealthChange": 0
                        }
                    }
                ]
            },
            {
                "id": "act1_enc2",
                "image": "encounters/act1_enc2.png",
                "scenario": "A small, dilapidated shuttle hails you, its pilot pleading for urgent medical supplies. They claim their crew is suffering from a virulent space plague, and they're stranded. Your medical bay has limited supplies, but helping them could deplete your own reserves.",
                "options": [
                    {
                        "text": "Dock with the shuttle and have Dr. Aris assess the situation and offer medical aid.",
                        "outcome": {
                            "text": "Dr. Aris cautiously boards the shuttle, quickly diagnosing a non-contagious but debilitating foodborne illness, not a plague. Your timely intervention saves their crew. In gratitude, they share detailed charts of safe shortcuts through the nebula and a small cache of rare alien herbs.",
                            "shipHealthChange": 0,
                            "treasureChange": 75,
                            "crewHealthChange": 0,
                            "specialEffect": "nebulaShortcutUnlocked"
                        }
                    },
                    {
                        "text": "Maintain distance and politely decline, citing the risk of contagion and limited resources.",
                        "outcome": {
                            "text": "You prioritize your crew's safety and mission, leaving the stranded shuttle behind. While you avoid any potential risks, a pang of guilt lingers, and you wonder if you missed an opportunity to aid fellow travelers.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0
                        }
                    }
                ]
            },
            {
                "id": "act1_enc3",
                "image": "encounters/act1_enc3.png",
                "scenario": "Your long-range sensors detect a faint, rhythmic anomaly – too structured to be natural. Captain Eva believes it might be a hidden, automated defense system or a long-lost cache, emitting a repeating, cryptic signal.",
                "options": [
                    {
                        "text": "Send a small away team (Eva and Aris) to investigate the source of the signal directly.",
                        "outcome": {
                            "text": "Captain Eva's tactical mind combined with Dr. Aris's intellectual curiosity leads to the discovery of a heavily camouflaged ancient data vault. They successfully bypass its traps, securing valuable navigational data and a small amount of ancient currency. However, a minor energy spike during the bypass briefly overloads your ship's comms.",
                            "shipHealthChange": -5,
                            "treasureChange": 100,
                            "crewHealthChange": 0
                        }
                    },
                    {
                        "text": "Analyze the signal from a safe distance, trying to decipher its meaning without direct engagement.",
                        "outcome": {
                            "text": "You spend valuable time meticulously analyzing the signal from afar. Dr. Aris determines it's a decaying automated distress beacon, but its data is too corrupted to be useful. You avoid danger but gain nothing, and the time spent could have been used more efficiently.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0
                        }
                    }
                ]
            }
        ],
        "summary": "Act 1 Summary: Your journey through the Nebula's Embrace has tested your crew's resolve. You've encountered abandoned vessels, answered distress calls, and navigated spatial anomalies. The path ahead remains uncertain, but your crew stands ready for whatever comes next."
    },
    {
        "title": "Act 2: The Whispering Wastes",
        "encounters": [
            {
                "id": "act2_enc1",
                "image": "encounters/act2_enc1.png",
                "scenario": "You enter a vast asteroid field, and your sensors detect faint energy signatures emanating from several of the larger asteroids. It could be valuable ore, or something more sinister.",
                "options": [
                    {
                        "text": "Attempt a precise, high-risk maneuver to harvest cosmic pearls without disturbing the creature, relying on Zephyr's piloting.",
                        "outcome": {
                            "text": "Zephyr executes an incredibly delicate maneuver, weaving the ship close to the leviathan. You manage to extract several large cosmic pearls from its outer layers, significantly boosting your treasure. The creature stirs but doesn't react aggressively, allowing you to depart safely. A truly daring feat!",
                            "shipHealthChange": 0,
                            "treasureChange": 250,
                            "crewHealthChange": 0
                        }
                    },
                    {
                        "text": "Wait for the space whale to pass, taking the safe but time-consuming route around it.",
                        "outcome": {
                            "text": "You patiently wait for the immense creature to drift past, taking the long way around. While you avoid any potential conflict, the delay eats into your mission time, and you miss out on a rare opportunity for significant treasure.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0
                        }
                    }
                ]
            },
            {
                "id": "act2_enc2",
                "image": "encounters/act2_enc2.png",
                "scenario": "Your scanners detect an abandoned, perfectly intact escape pod adrift. Its internal systems show faint signs of life, but a dangerous, ionized storm is rapidly approaching its location. Retrieving it would be a race against time and the elements.",
                "options": [
                    {
                        "text": "Launch a rescue mission to retrieve the escape pod, risking exposure to the approaching storm.",
                        "outcome": {
                            "text": "You brave the fringes of the ionized storm to retrieve the pod. Inside, you find a lone, critically injured, but grateful survivor who turns out to be a skilled engineer. They offer to assist Jax with ship repairs, improving your ship's efficiency and providing some valuable data they recovered from their wrecked vessel. However, the storm causes minor damage to your exterior sensors.",
                            "shipHealthChange": -10,
                            "treasureChange": 50,
                            "crewHealthChange": -5,
                            "specialEffect": "jaxEfficiencyBoost"
                        }
                    },
                    {
                        "text": "It's too dangerous to attempt a rescue. Prioritize the ship's safety and bypass the storm.",
                        "outcome": {
                            "text": "You prioritize caution, leaving the escape pod to its fate as the storm engulfs it. You avoid any risk, but the image of the stranded survivor weighs on your conscience. You wonder what valuable information or help you might have forsaken.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0
                        }
                    }
                ]
            },
            {
                "id": "act2_enc3",
                "image": "encounters/act2_enc3.png",
                "scenario": "A small, heavily armed patrol ship of the Rival Faction and its Pirate Lord appears, blocking your path. They demand a significant toll for passage through their territory.",
                "options": [
                    {
                        "text": "Attempt to intimidate them with a show of force, relying on Captain Eva's commanding presence and your ship's weaponry.",
                        "outcome": {
                            "text": "Captain Eva broadcasts a chilling warning, backed by a simulated weapons lock. The enemy hesitates, and after a tense standoff, they decide you're not worth the trouble and back down. You pass through unmolested and without paying tribute, gaining a small boost to your reputation.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "specialEffect": "reputationGain"
                        }
                    },
                    {
                        "text": "Attempt to negotiate a smaller fee or offer a diversion, relying on Dr. Aris's quick thinking or Zephyr's evasive skills.",
                        "outcome": {
                            "text": "You try to negotiate, but the enemy is resolute. Your attempts to bargain or evade are met with scorn. They open fire, forcing you to pay a substantial tribute to avoid a protracted fight, damaging your ship and your pride.",
                            "shipHealthChange": -15,
                            "treasureChange": -100,
                            "crewHealthChange": 0
                        }
                    }
                ]
            }
        ],
        "summary": "Act 2 Summary: The Whispering Wastes proved to be a challenging expanse, pushing your crew's limits. You've navigated asteroid fields, dealt with cosmic threats, and faced moral dilemmas. The Star-Heart Gem feels closer, but the stakes are rising."
    },
    {
        "title": "Act 3: Heart of the Nebula",
        "encounters": [
            {
                "id": "act3_enc1",
                "image": "encounters/act3_enc1.png",
                "scenario": "You've reached the suspected location of the Star-Heart Gem. A massive, ancient alien structure looms in the void, radiating immense energy. It's protected by an energy shield.",
                "options": [
                    {
                        "text": "Have Jax meticulously reconfigure the conduits to safely disable the defenses and claim the gem.",
                        "outcome": {
                            "text": "Jax, grumbling but focused, works with incredible precision. One by one, the conduits disengage, and the Star-Heart Gem's protective field dissipates without incident. You claim the gem successfully and intact, a true testament to his engineering prowess. You also manage to siphon off a small amount of residual energy, slightly patching your ship's hull.",
                            "shipHealthChange": 10,
                            "treasureChange": 500,
                            "crewHealthChange": 0
                        }
                    },
                    {
                        "text": "Attempt to overload the central conduit, hoping to short-circuit the entire defense system.",
                        "outcome": {
                            "text": "You attempt to overload the system, but the ancient technology resists your brute-force approach. The conduits surge violently, triggering a localized energy discharge that severely damages the surrounding chamber and your ship. You manage to grab the gem, but at a heavy cost.",
                            "shipHealthChange": -30,
                            "treasureChange": 500,
                            "crewHealthChange": -10
                        }
                    }
                ]
            },
            {
                "id": "act3_enc2",
                "image": "encounters/act3_enc2.png",
                "scenario": "As you secure the Star-Heart Gem, the chamber begins to collapse! The ancient structure, weakened by your presence, is tearing itself apart. You need to escape immediately, but debris is falling rapidly, threatening to crush the ship.",
                "options": [
                    {
                        "text": "Zephyr attempts a desperate, high-speed evasive maneuver through the collapsing structure.",
                        "outcome": {
                            "text": "Zephyr pushes the ship to its absolute limits, performing gravity-defying rolls and dives. Debris scrapes past your hull, but you manage to burst free of the collapsing structure just as it implodes. A truly breathtaking escape, proving Zephyr's unparalleled piloting.",
                            "shipHealthChange": -10,
                            "treasureChange": 0,
                            "crewHealthChange": 0
                        }
                    },
                    {
                        "text": "Captain Eva orders a defensive retreat, attempting to shield the ship with remaining energy while moving slowly.",
                        "outcome": {
                            "text": "Captain Eva activates defensive protocols, but the sheer force of the collapsing structure is overwhelming. Heavy debris rains down, severely impacting your ship's shields and hull. You escape, but the ship is a battered wreck, and the crew is shaken.",
                            "shipHealthChange": -35,
                            "treasureChange": 0,
                            "crewHealthChange": -5
                        }
                    }
                ]
            },
            {
                "id": "act3_enc3",
                "image": "encounters/act3_enc3.png",
                "scenario": "You've made it out, Star-Heart Gem in hand, but a formidable, massive alien dreadnought is waiting. It's clearly here for the gem, and its weapons are already charged. This is the final stand.",
                "options": [
                    {
                        "text": "Initiate a full-scale assault, focusing fire on key weak points identified by Aris, and relying on Eva's tactical commands.",
                        "outcome": {
                            "text": "Captain Eva barks orders, directing concentrated fire at vulnerabilities Dr. Aris pinpointed. It's a brutal, drawn-out battle. Your ship takes heavy hits, and the crew fights valiantly, but you manage to cripple the dreadnought, forcing its retreat or destruction. A costly but decisive victory!",
                            "shipHealthChange": -50,
                            "treasureChange": 0,
                            "crewHealthChange": -20
                        }
                    },
                    {
                        "text": "Attempt a suicidal distraction maneuver, allowing Zephyr to jump to FTL while Jax tries to keep their shields occupied.",
                        "outcome": {
                            "text": "With Jax drawing enemy fire and Zephyr pushing the FTL drive beyond safe limits, you make a daring escape. The dreadnought is momentarily confused, allowing you to slip away into hyperspace. The ship sustains extreme stress damage, and Jax's makeshift diversion causes internal explosions, but you live to fight another day.",
                            "shipHealthChange": -40,
                            "treasureChange": 0,
                            "crewHealthChange": -10
                        }
                    }
                ]
            }
        ],
        "summary": "Act 3 Summary: The Heart of the Nebula pushed your crew to their absolute limits. You faced ancient defenses, confronted formidable guardians, and made a desperate escape. The fate of your mission, and your crew, now hangs in the balance."
    }
]
