[
    {
        "title": "Act 1: The Nebula's Embrace",
        "actDescription": "You've ventured into the Nebula's Embrace, a swirling expanse where starlight dims and secrets hide. The STAR-HEART-GEM still lies far ahead, deep within this cosmic labyrinth. Strange energy signatures ripple across your sensors, and faint, unsettling distress calls whisper through the void, hinting at the perils that await. <br><br>REMEMBER TO:<br>- Discuss the situation.<br>- Debate the options.<br>- Decide your fate together.",
        "encounters": [
            {
                "id": "act1_enc1",
                "displayName": "Crystalline Organism",
                "image": "encounters/act1_enc1.png",
                "scenario": "The nebula's haze tears open—a colossal crystalline leviathan drifts ahead, its jagged edges pulsing with violent energy discharges. Navigation systems scream as the hull shudders from dimensional shear. <br><br>'Captain,' Aris shouts over the static, 'its energy field is rewriting our physics!'",
                "options": [
                    {
                        "text": "Order a precision dive through the discharge field, trusting Zephyr's reflexes.",
                        "outcome": {
                            "image": "outcome/act1_enc1_outcome1.png",
                            "text": "Eva's command echoes—'Trust your reflexes!'—as Zephyr’s hands dance across the controls. Your ship shudders through the storm. The crew exhales as one. <br><br>Your ship's advanced sensors pick up a faint, repeating pattern – 'anomalous, but familiar'. The scent of burnt wiring clears, but the new sensor data suggests other intriguing signals might be closer than we think.",
                            "shipHealthChange": -5,
                            "treasureChange": 0,
                            "crewHealthChange": 5,
                            "nextId": "act1_enc2"
                        }
                    },
                    {
                        "text": "Overload the organism’s defenses—order Jax to rig a localized energy burst.",
                        "outcome": {
                            "image": "outcome/act1_enc1_outcome2.png",
                            "text": "Jax's solution works—mostly. The organism shatters, but his console explodes. <br><br>'Worth it,' he mutters. The blast disrupts the nebula's energy balance. Warning sirens blare as temporal eddies form. As the energy dissipates, a massive, ancient hulk is briefly revealed—a potential treasure, or a tomb.",
                            "shipHealthChange": -5,
                            "treasureChange": 0,
                            "crewHealthChange": -5,
                            "nextId": "act1_enc_ancient_derelict"
                        }
                    },
                    {
                        "text": "Have Dr. Aris deploy Fourier analyzers to deconstruct the emissions.",
                        "outcome": {
                            "image": "outcome/act1_enc1_outcome3.png",
                            "text": "Dr. Aris’s analyzers reveal a blueprint of an advanced, bio-mechanical system. The sensors pick up the same Fibonacci resonance, but it's a swirling vortex deeper within the nebula – an undeniable source calling to you.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_mysterious_anomaly"
                        }
                    }
                ]
            },
            {
                "id": "act1_enc2",
                "displayName": "Stranded Shuttle",
                "image": "encounters/act1_enc2.png",
                "scenario": "The ship stabilizes, the journey honed by your daring dive. Burnt insulation lingers—but sensors ping: a derelict shuttle drifts ahead, its distress call slicing through static, ‘...plague outbreak... help, please...’ <br><br>Eva’s hand hovers over the medical locker.",
                "options": [
                    {
                        "text": "Dock with the shuttle and have Dr. Aris assess the situation and offer medical aid.",
                        "outcome": {
                            "image": "outcome/act1_enc2_outcome1.png",
                            "text": "Dr. Aris finds spoiled rations, not a plague. The grateful captain gives a data chip with safe paths and a crate of Voidbloom herbs. <br><br>Aris suspects deeper motives. With new navigation data, you set course for less obvious but more lucrative destinations.",
                            "shipHealthChange": 0,
                            "treasureChange": 75,
                            "crewHealthChange": 10,
                            "nextId": "act1_enc_abandoned_mining_station"
                        }
                    },
                    {
                        "text": "Maintain distance and politely decline, citing the risk of contagion and limited resources.",
                        "outcome": {
                            "image": "outcome/act1_enc2_outcome2.png",
                            "text": "You prioritize your ship’s safety. Guilt gnaws, trust wavers. <br><br>As you pull away, the distress call cuts, replaced by encrypted data – the crystalline organism’s Fibonacci rhythm, echoing from a swirling void deeper in the nebula. Something demands attention.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": -10,
                            "nextId": "act1_enc_mysterious_anomaly"
                        }
                    },
                    {
                        "text": "Demand payment for your assistance, citing the risk.",
                        "outcome": {
                            "image": "outcome/act1_enc2_outcome3.png",
                            "text": "You demand 100 credits. The pilot complies, but mutters a warning. 'People remember this kind of stuff, you know...?' <br><br>Jax is pleased, but Aris disapproves. This action affects future dealings. Jax suggests investigating a rumored abandoned station for easy profits.",
                            "shipHealthChange": 0,
                            "treasureChange": 100,
                            "crewHealthChange": -10,
                            "nextId": "act1_enc_abandoned_mining_station"
                        }
                    }
                ]
            },
            {
                "id": "act1_enc_ancient_derelict",
                "displayName": "Ancient Derelict Ship",
                "image": "encounters/act1_enc_ancient_derelict.png",
                "scenario": "The blast's afterglow briefly illuminates a derelict warship. The light fades fast—minutes before it's hidden again, potentially by the temporal eddies your action created.",
                "options": [
                    {
                        "text": "Send a team to cautiously explore the derelict.",
                        "outcome": {
                            "image": "outcome/act1_enc_ancient_derelict_outcome1.png",
                            "text": "Inside, Jax grabs alien tech as lights die. 'Crystals siphoning our energy!' Aris warns. You escape with tech, nav systems rebooting. Aris believes this tech holds secrets. With it, your next challenge might be an energy flare, but you might have an edge.",
                            "shipHealthChange": -5,
                            "treasureChange": 150,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_energy_flare"
                        }
                    },
                    {
                        "text": "Scrap what you can from the exterior and move on.",
                        "outcome": {
                            "image": "outcome/act1_enc_ancient_derelict_outcome2.png",
                            "text": "Jax salvages meager credits. Aris notes fresh, precise cuts. A light flickers within. Zephyr urges departure. You escaped immediate danger, but something's unresolved. As the derelict fades, a massive energy flare erupts in your path.",
                            "shipHealthChange": 0,
                            "treasureChange": 50,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_energy_flare"
                        }
                    },
                    {
                        "text": "Attempt to reactivate parts of its ancient systems, hoping for a power boost.",
                        "outcome": {
                            "image": "outcome/act1_enc_ancient_derelict_outcome3.png",
                            "text": "Jax jury-rigs the reactor, shields spike to 200%, then your power core protests. <br><br>'Worth it?' Eva growls. You gained a temporary advantage, but at the cost of stability. The power surge leaves a bright trail, perhaps leading to an energy flare.",
                            "shipHealthChange": -15,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_energy_flare"
                        }
                    }
                ]
            },
            {
                "id": "act1_enc_mysterious_anomaly",
                "displayName": "Mysterious Anomaly",
                "image": "encounters/act1_enc_mysterious_anomaly.png",
                "scenario": "Whether from analysis or ignored pleas, you face it: a swirling vortex of Fibonacci-perfect energy. <br><br>‘It’s the source,’ Aris whispers, her analyzer overloading. The void thrums, as if recognizing you and the STAR-HEART GEM.",
                "options": [
                    {
                        "text": "Approach cautiously and attempt to analyze the anomaly with advanced scans.",
                        "outcome": {
                            "image": "outcome/act1_enc_mysterious_anomaly_outcome1.png",
                            "text": "Aris deciphers a 'gravitational haiku', the anomaly echoing the crystal's math. You gain valuable data and a hidden message: coordinates and a warning about 'The Weaver's Hunger'. <br><br>This draws the anomaly's attention. An abandoned mining station appears – resources, or more clues?",
                            "shipHealthChange": 0,
                            "treasureChange": 100,
                            "crewHealthChange": 5,
                            "nextId": "act1_enc_abandoned_mining_station"
                        }
                    },
                    {
                        "text": "Fire a low-power energy pulse to disrupt it and ensure safe passage.",
                        "outcome": {
                            "image": "outcome/act1_enc_mysterious_anomaly_outcome2.png",
                            "text": "Your pulse scrambles the anomaly's rhythm, then chaos. Shocks rattle the hull. <br><br>'We just made it angry,' Aris warns. The path clears, but the anomaly's light darkens, a persistent hum resonating within your ship. You earned passage, but also a curse. An old mining station flickers into view – resources, but caution advised.",
                            "shipHealthChange": -5,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_abandoned_mining_station"
                        }
                    }
                ]
            },
            {
                "id": "act1_enc_abandoned_mining_station",
                "displayName": "Abandoned Mining Station",
                "image": "encounters/act1_enc_abandoned_mining_station.png",
                "scenario": "Having navigated the anomaly, an old mining station appears, lights flickering, automated drones patrolling. Chance of ore, but also unknown dangers lurking within or drawn to its dormant power.",
                "options": [
                    {
                        "text": "Send a team to salvage what materials they can from the station's exterior.",
                        "outcome": {
                            "image": "outcome/act1_enc_abandoned_mining_station_outcome1.png",
                            "text": "You secure modest ore and equipment. Drones pass. Zephyr notes precise cuts on discarded materials. <br><br>As you leave, a massive energy flare erupts in your path, demanding immediate action.",
                            "shipHealthChange": 0,
                            "treasureChange": 75,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_energy_flare"
                        }
                    },
                    {
                        "text": "Attempt to bypass the automated defenses and enter the station for a deeper salvage.",
                        "outcome": {
                            "image": "outcome/act1_enc_abandoned_mining_station_outcome2.png",
                            "text": "Jax bypasses defenses, finding advanced tools and crystals you could trade for 200 credits and 'Nebula-Forged Alloys'. <br><br>An unstable conduit collapses, damaging your ship. You gained alloys, but at a cost. As the station recedes, a massive energy flare erupts ahead.",
                            "shipHealthChange": -10,
                            "treasureChange": 200,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_energy_flare"
                        }
                    },
                    {
                        "text": "Ignore the station. It's too risky for potential meager rewards.",
                        "outcome": {
                            "image": "outcome/act1_enc_abandoned_mining_station_outcome3.png",
                            "text": "You bypass the station. Aris detects faint, rhythmic energy signatures, as if it's 'breathing', wondering what secrets you left. <br><br>Your caution might have spared you from what now manifests: a massive energy flare.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_energy_flare"
                        }
                    }
                ]
            },
            {
                "id": "act1_enc_energy_flare",
                "displayName": "Unstable Energy Flare",
                "image": "encounters/act1_enc_energy_flare.png",
                "scenario": "As the station vanishes behind you, a massive energy flare erupts ahead, bathing everything in purple light. Dangerous radiation levels detected. <br><br>Act fast, especially if your ship is already reeling.",
                "options": [
                    {
                        "text": "Fire emergency deflectors and try to push through.",
                        "outcome": {
                            "image": "outcome/act1_enc_energy_flare_outcome1.png",
                            "text": "Deflectors strain, needing repair. The path clears, leading to a chaotic smuggler's den—repairs possible, but at a price.",
                            "shipHealthChange": -5,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_smugglers_den"
                        }
                    },
                    {
                        "text": "Execute a daring evasive maneuver, trusting Zephyr's piloting skills.",
                        "outcome": {
                            "image": "outcome/act1_enc_energy_flare_outcome2.png",
                            "text": "Zephyr's maneuvers gain 'flare-weaving' data. A hidden path opens, leading to a smuggler's den—risky, but with unique opportunities.",
                            "shipHealthChange": -5,
                            "treasureChange": 0,
                            "crewHealthChange": -5,
                            "nextId": "act1_enc_smugglers_den"
                        }
                    },
                    {
                        "text": "Have Dr. Aris study the flare for its unique properties, hoping to find a weakness.",
                        "outcome": {
                            "image": "outcome/act1_enc_energy_flare_outcome3.png",
                            "text": "Aris analyzes, gaining insights into ancient defenses, but radiation causes a power drain. These insights prepare you for what lies beyond—perhaps a signal marking the next leg of your journey.",
                            "shipHealthChange": -5,
                            "treasureChange": 150,
                            "crewHealthChange": -5,
                            "nextId": "act1_enc3"
                        }
                    }
                ]
            },
            {
                "id": "act1_enc_smugglers_den",
                "displayName": "Smugglers' Den",
                "image": "encounters/act1_enc_smugglers_den.png",
                "scenario": "Having navigated the flare, you arrive at a hidden smuggler's den, a nexus of illicit trade. Profit and trouble abound. The underworld demands its own payment.",
                "options": [
                    {
                        "text": "Attempt to trade for rare components with what treasure you have.",
                        "outcome": {
                            "image": "outcome/act1_enc_smugglers_den_outcome1.png",
                            "text": "You exchange 50 credits for illicit ship components, improving hull integrity. <br><br>This attracts attention later. Bolstered by upgrades, you focus on the faint energy signal marking the nebula's exit.",
                            "shipHealthChange": 10,
                            "treasureChange": -50,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc3"
                        },
                        "condition": {
                            "type": "treasure",
                            "value": 50,
                            "comparison": "greaterThanOrEqual"
                        }
                    },
                    {
                        "text": "Attempt to trade for rare components.",
                        "outcome": {
                            "image": "outcome/act1_enc_smugglers_den_outcome_fail_trade.png",
                            "text": "The smugglers scoff at your funds. You leave empty-handed. <br><br>Your only option is to pursue the faint, cryptic signal leading out of the nebula.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc3"
                        },
                        "condition": {
                            "type": "treasure",
                            "value": 50,
                            "comparison": "lessThan"
                        }
                    },
                    {
                        "text": "Engage in a high-stakes game of chance at the cantina.",
                        "outcome": {
                            "image": "outcome/act1_enc_smugglers_den_outcome2.png",
                            "text": "You win the game, netting 150 credits and learning underworld trade secrets and a handshake. Flush with credits and contacts, the faint energy signal seems less a mystery, now an opportunity.",
                            "shipHealthChange": 0,
                            "treasureChange": 150,
                            "crewHealthChange": 0,
                            "specialEffect": "minorInfoGain",
                            "nextId": "act1_enc3"
                        },
                        "condition": {
                            "type": "treasure",
                            "value": 150,
                            "comparison": "greaterThanOrEqual"
                        }
                    },
                    {
                        "text": "Engage in a high-stakes game of chance.",
                        "outcome": {
                            "image": "outcome/act1_enc_smugglers_den_outcome_fail_gamble.png",
                            "text": "You can't afford the game. Observing, you notice a shifty figure. Having gained nothing, the faint energy signal beckons, your only remaining path.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc3"
                        },
                        "condition": {
                            "type": "treasure",
                            "value": 150,
                            "comparison": "lessThan"
                        }
                    },
                    {
                        "text": "Avoid engaging with the locals and move on.",
                        "outcome": {
                            "image": "outcome/act1_enc_smugglers_den_outcome3.png",
                            "text": "You avoid entanglements. Departing, you find fuel reserves lower – a 'tax'. With the den behind you and depleted resources, the faint, structured energy signal remains your primary lead.",
                            "shipHealthChange": 0,
                            "treasureChange": -25,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc3"
                        }
                    }
                ],
                "options": [
                    {
                        "text": "Speak with the stranger.",
                        "outcome": {
                            "image": "outcome/act1_enc_smugglers_den_outcome1.png",
                            "text": "The stranger praises Zephyr's piloting skills and offers a discount on components.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "specialEffect": "smugglerDiscount",
                            "nextId": "act1_enc_smugglers_den"
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "credZephyr",
                            "comparison": "set"
                        }
                    },
                    {
                        "text": "Speak with the stranger.",
                        "outcome": {
                            "image": "outcome/act1_enc_smugglers_den_outcome1.png",
                            "text": "The stranger greets Jax like an old friend and slips him some credits.",
                            "shipHealthChange": 0,
                            "treasureChange": 50,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_smugglers_den"
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "credJax",
                            "comparison": "set"
                        }
                    },
                    {
                        "text": "Speak with the stranger.",
                        "outcome": {
                            "image": "outcome/act1_enc_smugglers_den_outcome1.png",
                            "text": "The stranger seems more interested in extracting information from Dr. Aris before dismissing the crew.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_smugglers_den"
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "credAris",
                            "comparison": "set"
                        }
                    },
                    {
                        "text": "Speak with the stranger.",
                        "outcome": {
                            "image": "outcome/act1_enc_smugglers_den_outcome1.png",
                            "text": "The stranger is uninterested in speaking with the crew.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_smugglers_den"
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "credZephyr",
                            "comparison": "not_set"
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "credJax",
                            "comparison": "not_set"
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "credAris",
                            "comparison": "not_set"
                        }
                    }
                ]
            },
            {
                "id": "act1_enc3",
                "displayName": "Faint Energy Signal",
                "image": "encounters/act1_enc3.png",
                "scenario": "After navigating flares and smugglers, a faint energy signature – too structured to be natural – is detected. <br><br>Eva suspects a defense system or lost cache. This feels like the nebula's end, but what lies beyond?",
                "options": [
                    {
                        "text": "Send a small away team, Eva and Aris, to investigate the source of the signal directly.",
                        "outcome": {
                            "image": "outcome/act1_enc3_outcome1.png",
                            "text": "Eva and Aris find a camouflaged ancient data vault, bypassing traps for navigational data worth about 100 credits and schematics of defenses in the Whispering Wastes. <br><br>A minor energy spike briefly isolates your comms. This feels like a major step towards the Whispering Wastes.",
                            "shipHealthChange": -5,
                            "treasureChange": 100,
                            "crewHealthChange": 0,
                            "specialEffect": "scientificDataAcquired",
                            "nextId": "act2_enc1"
                        }
                    },
                    {
                        "text": "Analyze the signal from a safe distance, trying to decipher its meaning without direct engagement.",
                        "outcome": {
                            "image": "outcome/act1_enc3_outcome2.png",
                            "text": "Aris determines it's a decaying distress beacon, data corrupted. You gain nothing immediate, but observing its decay, Aris theorizes 'memory erosion' in advanced systems, crucial for understanding the Whispering Wastes and ancient forces.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "specialEffect": "arisAnalyticalInsight",
                            "nextId": "act2_enc1"
                        }
                    }
                ]
            }
        ],
        "summary": "The Nebula's Embrace tested you. Now, prepare for the desolate Whispering Wastes, a realm of cosmic anomalies and moral dilemmas. No sign of the STAR-HEART GEM yet, but the path ahead is clearer. The crew's skills have sharpened, and your ship is ready for the challenges to come."
    },
    {
        "title": "Act 2: The Whispering Wastes",
        "actDescription": "You emerge into the Whispering Wastes, a desolate expanse where reality itself bends. Ancient anomalies twist through the void, and cunning foes lurk in the cosmic dust. <br><br>Keep your eyes peeled for the STAR-HEART GEM, but trust no one – its allure draws many. Brace yourselves, for in these wastes, only the vigilant survive.",
        "encounters": [
            {
                "id": "act2_enc1",
                "displayName": "Asteroid Field Threat",
                "image": "encounters/act2_enc1.png",
                "scenario": "You enter a vast asteroid field, and your sensors detect faint, organic energy signatures emanating from several of the larger asteroids. <br><br>It appears to be an immense, docile space leviathan, subtly integrated with the cosmic dust, but its presence creates dangerous gravitational eddies. It could be valuable, or simply an obstacle.",
                "options": [
                    {
                        "text": "Attempt a precise, high-risk maneuver to harvest cosmic pearls without disturbing the creature, relying on Zephyr's piloting.",
                        "outcome": {
                            "image": "outcome/act2_enc1_outcome1.png",
                            "text": "Zephyr executes an incredibly delicate maneuver, weaving the ship close to the leviathan. You manage to extract several large cosmic pearls from its outer layers, appraised for 250 credits. <br><br>The creature stirs but doesn't react aggressively, allowing you to depart safely. <br><br>'A truly daring feat!' Zephyr grins. The pearls shimmer, hinting at greater treasures hidden in this ancient space. Your successful stealth operation also grants you insight into bypassing complex organic signatures, a skill that could prove invaluable when facing ancient, integrated defenses. You now set course towards faint readings that suggest long-forgotten ruins, where more organic materials might be found.",
                            "shipHealthChange": 0,
                            "treasureChange": 250,
                            "crewHealthChange": 0,
                            "nextId": "act2_enc_ancient_ruins"
                        }
                    },
                    {
                        "text": "Wait for the space whale to pass, taking the safe but time-consuming route around it.",
                        "outcome": {
                            "image": "outcome/act2_enc1_outcome2.png",
                            "text": "You patiently wait for the immense creature to drift past, taking the long way around. While you avoid any potential conflict, the delay eats into your mission time, and you miss out on a rare opportunity for significant treasure. <br><br>'A cautious move, Captain,' Eva notes, 'but sometimes the safest path costs us more than just time.' As you finally clear the leviathan's shadow, a faint distress signal reaches your sensors, cutting through the static from a nearby asteroid field.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": -2,
                            "nextId": "act2_enc2"
                        }
                    }
                ]
            },
            {
                "id": "act2_enc2",
                "displayName": "Distress Pod",
                "image": "encounters/act2_enc2.png",
                "scenario": "Your sensors pick up a faint distress signal from a small escape pod. It's adrift near a dangerous asteroid field, and a solar storm is rapidly approaching. Time is short.",
                "options": [
                    {
                        "text": "Launch a rescue mission to retrieve the escape pod, risking exposure to the approaching storm.",
                        "outcome": {
                            "image": "outcome/act2_enc2_outcome1.png",
                            "text": "Jax efficiently preps a retrieval drone, swiftly bringing the pod aboard before the storm hits. The rescued pilot is grateful, and Jax's flawless execution improves his engineering systems and efficiency, a skill that could prove invaluable in critical situations. <br><br>With the rescue complete, your ship's improved systems allow you to swiftly chart a course toward a major galactic trade lane, where a merchant convoy is likely to be found.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 5,
                            "specialEffect": "jaxEfficiencyBoost",
                            "nextId": "act2_enc_merchant_convoy"
                        }
                    },
                    {
                        "text": "Prioritize ship safety and maneuver around the storm, leaving the distress pod behind.",
                        "outcome": {
                            "image": "outcome/act2_enc2_outcome2.png",
                            "text": "You expertly navigate the edges of the brewing solar storm, prioritizing your ship's safety. The distress signal fades behind you. <br><br>While you avoid risk, the lingering thought of the stranded pilot weighs on the crew. Aris sighs softly, 'A necessary evil, perhaps, but it doesn't sit right.' Your cautious route, however, has placed you directly on a known trade route, where a merchant convoy is now visible on long-range scanners.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": -2,
                            "nextId": "act2_enc_merchant_convoy"
                        }
                    }
                ]
            },
            {
                "id": "act2_enc_merchant_convoy",
                "displayName": "Merchant Convoy",
                "image": "encounters/act2_enc_merchant_convoy.png",
                "scenario": "A slow-moving merchant convoy, laden with cargo, appears on your long-range scanners. They are likely carrying valuable goods, but are also well-armed and wary of pirates.",
                "options": [
                    {
                        "text": "Hail them peacefully and attempt to trade for supplies or information.",
                        "outcome": {
                            "image": "outcome/act2_enc_merchant_convoy_outcome1.png",
                            "text": "You establish contact. The merchants are cautious but willing to trade. You exchange some of your credits for valuable medical supplies and a map of local anomalies, which sells for 75 credits. A profitable and amicable exchange. <br><br>'Good business, Captain,' Eva nods. This successful interaction could smooth over future encounters, particularly if you manage to avoid any significant negative reputation. Your next target: the major Rival Faction patrol that guards the entrance to the deeper Wastes.",
                            "shipHealthChange": 0,
                            "treasureChange": 75,
                            "crewHealthChange": 10,
                            "nextId": "act2_enc3"
                        },
                        "condition": {
                            "type": "treasure",
                            "value": 25,
                            "comparison": "greaterThanOrEqual"
                        }
                    },
                    {
                        "text": "Hail them peacefully and attempt to trade.",
                        "outcome": {
                            "image": "outcome/act2_enc_merchant_convoy_outcome_fail_trade.png",
                            "text": "You hail them, but without sufficient credits for a worthwhile trade, they politely but firmly decline your request. <br><br>'Next time, bring more than good intentions,' a merchant scoffs over the comms. You leave empty-handed. <br><br>'A missed opportunity,' Aris mutters. With little to gain here, your only option is to continue your journey towards the Rival Faction's territory.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act2_enc3"
                        },
                        "condition": {
                            "type": "treasure",
                            "value": 25,
                            "comparison": "lessThan"
                        }
                    },
                    {
                        "text": "Use the subtle trade signals learned from the Smugglers' Den to gain a better deal.",
                        "outcome": {
                            "image": "outcome/act2_enc_merchant_convoy_outcome_smuggler_info.png",
                            "text": "You send a coded signal, a subtle nod to the galactic underworld. The lead merchant's demeanor shifts; they recognize the sign. You receive a preferential trade, gaining medical supplies and a rare mapping device for a reduced cost. Jax gives a knowing smirk, <br><br>'Always pays to know the right people, Captain.' This underworld connection proves invaluable, and your reputation among certain factions may now precede you. <br><br>Your next challenge: confronting the Rival Faction's heavily armed patrol that guards the entrance to the deeper Wastes.",
                            "shipHealthChange": 0,
                            "treasureChange": 125,
                            "crewHealthChange": 15,
                            "specialEffect": "minorInfoGain",
                            "nextId": "act2_enc3"
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "minorInfoGain",
                            "comparison": "set"
                        }
                    },
                    {
                        "text": "Attempt a high-speed ambush to raid their cargo.",
                        "outcome": {
                            "image": "outcome/act2_enc_merchant_convoy_outcome2.png",
                            "text": "Your ambush is swift and brutal. The convoy's escorts are quickly overwhelmed. You secure a large haul of valuable cargo, but the merchants' distress signals alert nearby authorities, marking you as a pirate. <br><br>'Worth every credit,' Jax laughs, but Aris looks grim. 'This will haunt us, Captain. We've gained wealth, but lost our standing.' Your reputation as a pirate now precedes you, and you can almost guarantee the Rival Faction's patrol will be waiting for you, eager to exact tribute or worse.",
                            "shipHealthChange": -15,
                            "
