[
    {
        "title": "Act 1: The Nebula's Embrace",
        "actDescription": "You've ventured into the Nebula's Embrace, a swirling expanse where starlight dims and secrets hide. The STAR-HEART-GEM still lies far ahead, deep within this cosmic labyrinth. Strange energy signatures ripple across your sensors, and faint, unsettling distress calls whisper through the void, hinting at the perils that await. <br><br>Discuss your approach with your crew and decide your course. Once you've committed to a path, there's no turning back.",
        "encounters": [
            {
                "id": "act1_enc1",
                "displayName": "Crystalline Organism",
                "image": "encounters/act1_enc1.png",
                "scenario": "The nebula's haze tears open—a colossal crystalline leviathan drifts ahead, its jagged edges pulsing with violent energy discharges. Navigation systems scream as the hull shudders from dimensional shear. <br><br>'Captain,' Aris shouts over the static, 'its energy field is rewriting our physics!'",
                "options": [
                    {
                        "text": "Order a precision dive through the discharge field, trusting Zephyr's reflexes.",
                        "outcome": {
                            "image": "outcome/act1_enc1_outcome1.png",
                            "text": "Eva's command echoes—'Trust your reflexes!'—as Zephyr’s hands dance across the controls. Your ship shudders through the storm. The crew exhales as one. <br><br>Your ship's advanced sensors pick up a faint, repeating pattern – 'anomalous, but familiar'. The scent of burnt wiring clears, but the new sensor data suggests other intriguing signals might be closer than we think.",
                            "shipHealthChange": -5,
                            "treasureChange": 0,
                            "crewHealthChange": 5,
                            "nextId": "act1_enc2"
                        }
                    },
                    {
                        "text": "Overload the organism’s defenses—order Jax to rig a localized energy burst.",
                        "outcome": {
                            "image": "outcome/act1_enc1_outcome2.png",
                            "text": "Jax's solution works—mostly. The organism shatters, but his console explodes. <br><br>'Worth it,' he mutters. The blast disrupts the nebula's energy balance. Warning sirens blare as temporal eddies form. As the energy dissipates, a massive, ancient hulk is briefly revealed—a potential treasure, or a tomb.",
                            "shipHealthChange": -5,
                            "treasureChange": 0,
                            "crewHealthChange": -5,
                            "nextId": "act1_enc_ancient_derelict"
                        }
                    },
                    {
                        "text": "Have Dr. Aris deploy Fourier analyzers to deconstruct the emissions.",
                        "outcome": {
                            "image": "outcome/act1_enc1_outcome3.png",
                            "text": "Dr. Aris’s analyzers reveal a blueprint of an advanced, bio-mechanical system. The sensors pick up the same Fibonacci resonance, but it's a swirling vortex deeper within the nebula – an undeniable source calling to you.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_mysterious_anomaly"
                        }
                    }
                ]
            },
            {
                "id": "act1_enc2",
                "displayName": "Stranded Shuttle",
                "image": "encounters/act1_enc2.png",
                "scenario": "The ship stabilizes, the journey honed by your daring dive. Burnt insulation lingers—but sensors ping: a derelict shuttle drifts ahead, its distress call slicing through static, ‘...plague outbreak... help, please...’ <br><br>Eva’s hand hovers over the medical locker.",
                "options": [
                    {
                        "text": "Dock with the shuttle and have Dr. Aris assess the situation and offer medical aid.",
                        "outcome": {
                            "image": "outcome/act1_enc2_outcome1.png",
                            "text": "Dr. Aris finds spoiled rations, not a plague. The grateful captain gives a data chip with safe paths and a crate of Voidbloom herbs. <br><br>Aris suspects deeper motives. With new navigation data, you set course for less obvious but more lucrative destinations.",
                            "shipHealthChange": 0,
                            "treasureChange": 75,
                            "crewHealthChange": 10,
                            "nextId": "act1_enc_abandoned_mining_station"
                        }
                    },
                    {
                        "text": "Maintain distance and politely decline, citing the risk of contagion and limited resources.",
                        "outcome": {
                            "image": "outcome/act1_enc2_outcome2.png",
                            "text": "You prioritize your ship’s safety. Guilt gnaws, trust wavers. <br><br>As you pull away, the distress call cuts, replaced by encrypted data – the crystalline organism’s Fibonacci rhythm, echoing from a swirling void deeper in the nebula. Something demands attention.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": -10,
                            "nextId": "act1_enc_mysterious_anomaly"
                        }
                    },
                    {
                        "text": "Demand payment for your assistance, citing the risk.",
                        "outcome": {
                            "image": "outcome/act1_enc2_outcome3.png",
                            "text": "You demand 100 credits. The pilot complies, but mutters a warning. 'People remember this kind of stuff, you know...?' <br><br>Jax is pleased, but Aris disapproves. This action affects future dealings. Jax suggests investigating a rumored abandoned station for easy profits.",
                            "shipHealthChange": 0,
                            "treasureChange": 100,
                            "crewHealthChange": -10,
                            "nextId": "act1_enc_abandoned_mining_station"
                        }
                    }
                ]
            },
            {
                "id": "act1_enc_ancient_derelict",
                "displayName": "Ancient Derelict Ship",
                "image": "encounters/act1_enc_ancient_derelict.png",
                "scenario": "The blast's afterglow briefly illuminates a derelict warship. The light fades fast—minutes before it's hidden again, potentially by the temporal eddies your action created.",
                "options": [
                    {
                        "text": "Send a team to cautiously explore the derelict.",
                        "outcome": {
                            "image": "outcome/act1_enc_ancient_derelict_outcome1.png",
                            "text": "Inside, Jax grabs alien tech as lights die. 'Crystals siphoning our energy!' Aris warns. You escape with tech, nav systems rebooting. Aris believes this tech holds secrets. With it, your next challenge might be an energy flare, but you might have an edge.",
                            "shipHealthChange": -5,
                            "treasureChange": 150,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_energy_flare"
                        }
                    },
                    {
                        "text": "Scrap what you can from the exterior and move on.",
                        "outcome": {
                            "image": "outcome/act1_enc_ancient_derelict_outcome2.png",
                            "text": "Jax salvages meager credits. Aris notes fresh, precise cuts. A light flickers within. Zephyr urges departure. You escaped immediate danger, but something's unresolved. As the derelict fades, a massive energy flare erupts in your path.",
                            "shipHealthChange": 0,
                            "treasureChange": 50,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_energy_flare"
                        }
                    },
                    {
                        "text": "Attempt to reactivate parts of its ancient systems, hoping for a power boost.",
                        "outcome": {
                            "image": "outcome/act1_enc_ancient_derelict_outcome3.png",
                            "text": "Jax jury-rigs the reactor, shields spike to 200%, then your power core protests. <br><br>'Worth it?' Eva growls. You gained a temporary advantage, but at the cost of stability. The power surge leaves a bright trail, perhaps leading to an energy flare.",
                            "shipHealthChange": -15,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_energy_flare"
                        }
                    }
                ]
            },
            {
                "id": "act1_enc_mysterious_anomaly",
                "displayName": "Mysterious Anomaly",
                "image": "encounters/act1_enc_mysterious_anomaly.png",
                "scenario": "Whether from analysis or ignored pleas, you face it: a swirling vortex of Fibonacci-perfect energy. <br><br>‘It’s the source,’ Aris whispers, her analyzer overloading. The void thrums, as if recognizing you and the STAR-HEART GEM.",
                "options": [
                    {
                        "text": "Approach cautiously and attempt to analyze the anomaly with advanced scans.",
                        "outcome": {
                            "image": "outcome/act1_enc_mysterious_anomaly_outcome1.png",
                            "text": "Aris deciphers a 'gravitational haiku', the anomaly echoing the crystal's math. You gain valuable data and a hidden message: coordinates and a warning about 'The Weaver's Hunger'. <br><br>This draws the anomaly's attention. An abandoned mining station appears – resources, or more clues?",
                            "shipHealthChange": 0,
                            "treasureChange": 100,
                            "crewHealthChange": 5,
                            "nextId": "act1_enc_abandoned_mining_station"
                        }
                    },
                    {
                        "text": "Fire a low-power energy pulse to disrupt it and ensure safe passage.",
                        "outcome": {
                            "image": "outcome/act1_enc_mysterious_anomaly_outcome2.png",
                            "text": "Your pulse scrambles the anomaly's rhythm, then chaos. Shocks rattle the hull. <br><br>'We just made it angry,' Aris warns. The path clears, but the anomaly's light darkens, a persistent hum resonating within your ship. You earned passage, but also a curse. An old mining station flickers into view – resources, but caution advised.",
                            "shipHealthChange": -5,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_abandoned_mining_station"
                        }
                    }
                ]
            },
            {
                "id": "act1_enc_abandoned_mining_station",
                "displayName": "Abandoned Mining Station",
                "image": "encounters/act1_enc_abandoned_mining_station.png",
                "scenario": "Having navigated the anomaly, an old mining station appears, lights flickering, automated drones patrolling. Chance of ore, but also unknown dangers lurking within or drawn to its dormant power.",
                "options": [
                    {
                        "text": "Send a team to salvage what materials they can from the station's exterior.",
                        "outcome": {
                            "image": "outcome/act1_enc_abandoned_mining_station_outcome1.png",
                            "text": "You secure modest ore and equipment. Drones pass. Zephyr notes precise cuts on discarded materials. <br><br>As you leave, a massive energy flare erupts in your path, demanding immediate action.",
                            "shipHealthChange": 0,
                            "treasureChange": 75,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_energy_flare"
                        }
                    },
                    {
                        "text": "Attempt to bypass the automated defenses and enter the station for a deeper salvage.",
                        "outcome": {
                            "image": "outcome/act1_enc_abandoned_mining_station_outcome2.png",
                            "text": "Jax bypasses defenses, finding advanced tools and crystals you could trade for 200 credits and 'Nebula-Forged Alloys'. <br><br>An unstable conduit collapses, damaging your ship. You gained alloys, but at a cost. As the station recedes, a massive energy flare erupts ahead.",
                            "shipHealthChange": -10,
                            "treasureChange": 200,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_energy_flare"
                        }
                    },
                    {
                        "text": "Ignore the station. It's too risky for potential meager rewards.",
                        "outcome": {
                            "image": "outcome/act1_enc_abandoned_mining_station_outcome3.png",
                            "text": "You bypass the station. Aris detects faint, rhythmic energy signatures, as if it's 'breathing', wondering what secrets you left. <br><br>Your caution might have spared you from what now manifests: a massive energy flare.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_energy_flare"
                        }
                    }
                ]
            },
            {
                "id": "act1_enc_energy_flare",
                "displayName": "Unstable Energy Flare",
                "image": "encounters/act1_enc_energy_flare.png",
                "scenario": "As the station vanishes behind you, a massive energy flare erupts ahead, bathing everything in purple light. Dangerous radiation levels detected. <br><br>Act fast, especially if your ship is already reeling.",
                "options": [
                    {
                        "text": "Fire emergency deflectors and try to push through.",
                        "outcome": {
                            "image": "outcome/act1_enc_energy_flare_outcome1.png",
                            "text": "Deflectors strain, needing repair. The path clears, leading to a chaotic smuggler's den—repairs possible, but at a price.",
                            "shipHealthChange": -5,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc_smugglers_den"
                        }
                    },
                    {
                        "text": "Execute a daring evasive maneuver, trusting Zephyr's piloting skills.",
                        "outcome": {
                            "image": "outcome/act1_enc_energy_flare_outcome2.png",
                            "text": "Zephyr's maneuvers gain 'flare-weaving' data. A hidden path opens, leading to a smuggler's den—risky, but with unique opportunities.",
                            "shipHealthChange": -5,
                            "treasureChange": 0,
                            "crewHealthChange": -5,
                            "nextId": "act1_enc_smugglers_den"
                        }
                    },
                    {
                        "text": "Have Dr. Aris study the flare for its unique properties, hoping to find a weakness.",
                        "outcome": {
                            "image": "outcome/act1_enc_energy_flare_outcome3.png",
                            "text": "Aris analyzes, gaining insights into ancient defenses, but radiation causes a power drain. These insights prepare you for what lies beyond—perhaps a signal marking the next leg of your journey.",
                            "shipHealthChange": -5,
                            "treasureChange": 150,
                            "crewHealthChange": -5,
                            "nextId": "act1_enc3"
                        }
                    }
                ]
            },
            {
                "id": "act1_enc_smugglers_den",
                "displayName": "Smugglers' Den",
                "image": "encounters/act1_enc_smugglers_den.png",
                "scenario": "Having navigated the flare, you arrive at a hidden smuggler's den, a nexus of illicit trade. Profit and trouble abound. The underworld demands its own payment.",
                "options": [
                    {
                        "text": "Attempt to trade for rare components with what treasure you have.",
                        "outcome": {
                            "image": "outcome/act1_enc_smugglers_den_outcome1.png",
                            "text": "You exchange 50 credits for illicit ship components, improving hull integrity. <br><br>This attracts attention later. Bolstered by upgrades, you focus on the faint energy signal marking the nebula's exit.",
                            "shipHealthChange": 10,
                            "treasureChange": -50,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc3"
                        },
                        "condition": {
                            "type": "treasure",
                            "value": 50,
                            "comparison": "greaterThanOrEqual"
                        }
                    },
                    {
                        "text": "Attempt to trade for rare components.",
                        "outcome": {
                            "image": "outcome/act1_enc_smugglers_den_outcome_fail_trade.png",
                            "text": "The smugglers scoff at your funds. You leave empty-handed. <br><br>Your only option is to pursue the faint, cryptic signal leading out of the nebula.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc3"
                        },
                        "condition": {
                            "type": "treasure",
                            "value": 50,
                            "comparison": "lessThan"
                        }
                    },
                    {
                        "text": "Engage in a high-stakes game of chance at the cantina.",
                        "outcome": {
                            "image": "outcome/act1_enc_smugglers_den_outcome2.png",
                            "text": "You win the game, netting 150 credits and learning underworld trade secrets and a handshake. Flush with credits and contacts, the faint energy signal seems less a mystery, now an opportunity.",
                            "shipHealthChange": 0,
                            "treasureChange": 150,
                            "crewHealthChange": 0,
                            "specialEffect": "minorInfoGain",
                            "nextId": "act1_enc3"
                        },
                        "condition": {
                            "type": "treasure",
                            "value": 150,
                            "comparison": "greaterThanOrEqual"
                        }
                    },
                    {
                        "text": "Engage in a high-stakes game of chance.",
                        "outcome": {
                            "image": "outcome/act1_enc_smugglers_den_outcome_fail_gamble.png",
                            "text": "You can't afford the game. Observing, you notice a shifty figure. Having gained nothing, the faint energy signal beckons, your only remaining path.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc3"
                        },
                        "condition": {
                            "type": "treasure",
                            "value": 150,
                            "comparison": "lessThan"
                        }
                    },
                    {
                        "text": "Avoid engaging with the locals and move on.",
                        "outcome": {
                            "image": "outcome/act1_enc_smugglers_den_outcome3.png",
                            "text": "You avoid entanglements. Departing, you find fuel reserves lower – a 'tax'. With the den behind you and depleted resources, the faint, structured energy signal remains your primary lead.",
                            "shipHealthChange": 0,
                            "treasureChange": -25,
                            "crewHealthChange": 0,
                            "nextId": "act1_enc3"
                        }
                    }
                ]
            },
            {
                "id": "act1_enc3",
                "displayName": "Faint Energy Signal",
                "image": "encounters/act1_enc3.png",
                "scenario": "After navigating flares and smugglers, a faint energy signature – too structured to be natural – is detected. <br><br>Eva suspects a defense system or lost cache. This feels like the nebula's end, but what lies beyond?",
                "options": [
                    {
                        "text": "Send a small away team, Eva and Aris, to investigate the source of the signal directly.",
                        "outcome": {
                            "image": "outcome/act1_enc3_outcome1.png",
                            "text": "Eva and Aris find a camouflaged ancient data vault, bypassing traps for navigational data worth about 100 credits and schematics of defenses in the Whispering Wastes. <br><br>A minor energy spike briefly isolates your comms. This feels like a major step towards the Whispering Wastes.",
                            "shipHealthChange": -5,
                            "treasureChange": 100,
                            "crewHealthChange": 0,
                            "specialEffect": "scientificDataAcquired",
                            "nextId": "act2_enc1"
                        }
                    },
                    {
                        "text": "Analyze the signal from a safe distance, trying to decipher its meaning without direct engagement.",
                        "outcome": {
                            "image": "outcome/act1_enc3_outcome2.png",
                            "text": "Aris determines it's a decaying distress beacon, data corrupted. You gain nothing immediate, but observing its decay, Aris theorizes 'memory erosion' in advanced systems, crucial for understanding the Whispering Wastes and ancient forces.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "specialEffect": "arisAnalyticalInsight",
                            "nextId": "act2_enc1"
                        }
                    }
                ]
            }
        ],
        "summary": "The Nebula's Embrace tested you. Now, prepare for the desolate Whispering Wastes, a realm of cosmic anomalies and moral dilemmas. No sign of the STAR-HEART GEM yet, but the path ahead is clearer. The crew's skills have sharpened, and your ship is ready for the challenges to come."
    },
    {
        "title": "Act 2: The Whispering Wastes",
        "actDescription": "You emerge into the Whispering Wastes, a desolate expanse where reality itself bends. Ancient anomalies twist through the void, and cunning foes lurk in the cosmic dust. <br><br>Keep your eyes peeled for the STAR-HEART GEM, but trust no one – its allure draws many. Brace yourselves, for in these wastes, only the vigilant survive.",
        "encounters": [
            {
                "id": "act2_enc1",
                "displayName": "Asteroid Field Threat",
                "image": "encounters/act2_enc1.png",
                "scenario": "You enter a vast asteroid field, and your sensors detect faint, organic energy signatures emanating from several of the larger asteroids. <br><br>It appears to be an immense, docile space leviathan, subtly integrated with the cosmic dust, but its presence creates dangerous gravitational eddies. It could be valuable, or simply an obstacle.",
                "options": [
                    {
                        "text": "Attempt a precise, high-risk maneuver to harvest cosmic pearls without disturbing the creature, relying on Zephyr's piloting.",
                        "outcome": {
                            "image": "outcome/act2_enc1_outcome1.png",
                            "text": "Zephyr executes an incredibly delicate maneuver, weaving the ship close to the leviathan. You manage to extract several large cosmic pearls from its outer layers, appraised for 250 credits. <br><br>The creature stirs but doesn't react aggressively, allowing you to depart safely. <br><br>'A truly daring feat!' Zephyr grins. The pearls shimmer, hinting at greater treasures hidden in this ancient space. Your successful stealth operation also grants you insight into bypassing complex organic signatures, a skill that could prove invaluable when facing ancient, integrated defenses. You now set course towards faint readings that suggest long-forgotten ruins, where more organic materials might be found.",
                            "shipHealthChange": 0,
                            "treasureChange": 250,
                            "crewHealthChange": 0,
                            "nextId": "act2_enc_ancient_ruins"
                        }
                    },
                    {
                        "text": "Wait for the space whale to pass, taking the safe but time-consuming route around it.",
                        "outcome": {
                            "image": "outcome/act2_enc1_outcome2.png",
                            "text": "You patiently wait for the immense creature to drift past, taking the long way around. While you avoid any potential conflict, the delay eats into your mission time, and you miss out on a rare opportunity for significant treasure. <br><br>'A cautious move, Captain,' Eva notes, 'but sometimes the safest path costs us more than just time.' As you finally clear the leviathan's shadow, a faint distress signal reaches your sensors, cutting through the static from a nearby asteroid field.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": -2,
                            "nextId": "act2_enc2"
                        }
                    }
                ]
            },
            {
                "id": "act2_enc2",
                "displayName": "Distress Pod",
                "image": "encounters/act2_enc2.png",
                "scenario": "Your sensors pick up a faint distress signal from a small escape pod. It's adrift near a dangerous asteroid field, and a solar storm is rapidly approaching. Time is short.",
                "options": [
                    {
                        "text": "Launch a rescue mission to retrieve the escape pod, risking exposure to the approaching storm.",
                        "outcome": {
                            "image": "outcome/act2_enc2_outcome1.png",
                            "text": "Jax efficiently preps a retrieval drone, swiftly bringing the pod aboard before the storm hits. The rescued pilot is grateful, and Jax's flawless execution improves his engineering systems and efficiency, a skill that could prove invaluable in critical situations. <br><br>With the rescue complete, your ship's improved systems allow you to swiftly chart a course toward a major galactic trade lane, where a merchant convoy is likely to be found.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 5,
                            "specialEffect": "jaxEfficiencyBoost",
                            "nextId": "act2_enc_merchant_convoy"
                        }
                    },
                    {
                        "text": "Prioritize ship safety and maneuver around the storm, leaving the distress pod behind.",
                        "outcome": {
                            "image": "outcome/act2_enc2_outcome2.png",
                            "text": "You expertly navigate the edges of the brewing solar storm, prioritizing your ship's safety. The distress signal fades behind you. <br><br>While you avoid risk, the lingering thought of the stranded pilot weighs on the crew. Aris sighs softly, 'A necessary evil, perhaps, but it doesn't sit right.' Your cautious route, however, has placed you directly on a known trade route, where a merchant convoy is now visible on long-range scanners.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": -2,
                            "nextId": "act2_enc_merchant_convoy"
                        }
                    }
                ]
            },
            {
                "id": "act2_enc_merchant_convoy",
                "displayName": "Merchant Convoy",
                "image": "encounters/act2_enc_merchant_convoy.png",
                "scenario": "A slow-moving merchant convoy, laden with cargo, appears on your long-range scanners. They are likely carrying valuable goods, but are also well-armed and wary of pirates.",
                "options": [
                    {
                        "text": "Hail them peacefully and attempt to trade for supplies or information.",
                        "outcome": {
                            "image": "outcome/act2_enc_merchant_convoy_outcome1.png",
                            "text": "You establish contact. The merchants are cautious but willing to trade. You exchange some of your credits for valuable medical supplies and a map of local anomalies, which sells for 75 credits. A profitable and amicable exchange. <br><br>'Good business, Captain,' Eva nods. This successful interaction could smooth over future encounters, particularly if you manage to avoid any significant negative reputation. Your next target: the major Rival Faction patrol that guards the entrance to the deeper Wastes.",
                            "shipHealthChange": 0,
                            "treasureChange": 75,
                            "crewHealthChange": 10,
                            "nextId": "act2_enc3"
                        },
                        "condition": {
                            "type": "treasure",
                            "value": 25,
                            "comparison": "greaterThanOrEqual"
                        }
                    },
                    {
                        "text": "Hail them peacefully and attempt to trade.",
                        "outcome": {
                            "image": "outcome/act2_enc_merchant_convoy_outcome_fail_trade.png",
                            "text": "You hail them, but without sufficient credits for a worthwhile trade, they politely but firmly decline your request. <br><br>'Next time, bring more than good intentions,' a merchant scoffs over the comms. You leave empty-handed. <br><br>'A missed opportunity,' Aris mutters. With little to gain here, your only option is to continue your journey towards the Rival Faction's territory.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act2_enc3"
                        },
                        "condition": {
                            "type": "treasure",
                            "value": 25,
                            "comparison": "lessThan"
                        }
                    },
                    {
                        "text": "Use the subtle trade signals learned from the Smugglers' Den to gain a better deal.",
                        "outcome": {
                            "image": "outcome/act2_enc_merchant_convoy_outcome_smuggler_info.png",
                            "text": "You send a coded signal, a subtle nod to the galactic underworld. The lead merchant's demeanor shifts; they recognize the sign. You receive a preferential trade, gaining medical supplies and a rare mapping device for a reduced cost. Jax gives a knowing smirk, <br><br>'Always pays to know the right people, Captain.' This underworld connection proves invaluable, and your reputation among certain factions may now precede you. <br><br>Your next challenge: confronting the Rival Faction's heavily armed patrol that guards the entrance to the deeper Wastes.",
                            "shipHealthChange": 0,
                            "treasureChange": 125,
                            "crewHealthChange": 15,
                            "specialEffect": "minorInfoGain",
                            "nextId": "act2_enc3"
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "minorInfoGain",
                            "comparison": "set"
                        }
                    },
                    {
                        "text": "Attempt a high-speed ambush to raid their cargo.",
                        "outcome": {
                            "image": "outcome/act2_enc_merchant_convoy_outcome2.png",
                            "text": "Your ambush is swift and brutal. The convoy's escorts are quickly overwhelmed. You secure a large haul of valuable cargo, but the merchants' distress signals alert nearby authorities, marking you as a pirate. <br><br>'Worth every credit,' Jax laughs, but Aris looks grim. 'This will haunt us, Captain. We've gained wealth, but lost our standing.' Your reputation as a pirate now precedes you, and you can almost guarantee the Rival Faction's patrol will be waiting for you, eager to exact tribute or worse.",
                            "shipHealthChange": -15,
                            "treasureChange": 300,
                            "crewHealthChange": -10,
                            "specialEffect": "pirateReputation",
                            "nextId": "act2_enc3"
                        }
                    },
                    {
                        "text": "Bypass the convoy and proceed, avoiding any engagement.",
                        "outcome": {
                            "image": "outcome/act2_enc_merchant_convoy_outcome3.png",
                            "text": "You opt for caution, altering your course to avoid the convoy. You gain nothing, but avoid any potential conflict or complications. <br><br>'Sometimes, the smartest move is no move at all,' Zephyr comments, though Jax looks disappointed. The journey continues smoothly, bringing you closer to the inevitable confrontation with the Rival Faction's patrol guarding the deeper Wastes.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act2_enc3"
                        }
                    }
                ]
            },
            {
                "id": "act2_enc3",
                "displayName": "Rival Faction Confrontation",
                "image": "encounters/act2_enc3.png",
                "scenario": "A small, heavily armed patrol ship of the Rival Faction and its Pirate Lord appears, blocking your path. They demand all your treasure for passage through their territory. <br><br>This is your first direct encounter with them, and their attitude may depend on your reputation.",
                "options": [
                    {
                        "text": "Attempt to intimidate them with a show of force, relying on Captain Eva's commanding presence and your ship's weaponry.",
                        "outcome": {
                            "image": "outcome/act2_enc3_outcome1.png",
                            "text": "Captain Eva broadcasts a chilling warning, backed by a simulated weapons lock. The enemy hesitates, and after a tense standoff, they decide you're not worth the trouble and back down. <br><br>'Consider this a warning,' the Pirate Lord growls over the comms before retreating. You pass through unmolested and without paying tribute, gaining a small boost to your reputation. The path ahead leads deeper towards the Nebula's Heart.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "specialEffect": "reputationGain",
                            "nextId": "act2_enc_hostile_patrol_check"
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "reputationLossMinor",
                            "comparison": "not_set"
                        }
                    },
                    {
                        "text": "Attempt to intimidate them, despite your tarnished reputation.",
                        "outcome": {
                            "image": "outcome/act2_enc3_outcome_reputation_fail.png",
                            "text": "Captain Eva's attempt at intimidation is met with scorn. 'We've heard about you,' sneers the Pirate Lord. 'Your kind pays double!' <br><br>They open fire immediately, forcing you to engage in a damaging skirmish. 'They knew who we were!' Jax shouts as alarms blare. You manage to break through, but your ship is battered and the crew is shaken. The path beyond, though clear, seems fraught with even more danger.",
                            "shipHealthChange": -20,
                            "treasureChange": 0,
                            "crewHealthChange": -10,
                            "specialEffect": "rivalFactionEncountered",
                            "nextId": "act2_enc_hostile_patrol_check"
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "reputationLossMinor",
                            "comparison": "set"
                        }
                    },
                    {
                        "text": "You are known as a pirate. Prepare for immediate battle.",
                        "outcome": {
                            "image": "outcome/act2_enc3_outcome_pirate.png",
                            "text": "As soon as your ship is identified, the Rival Faction opens fire, clearly recognizing you as a pirate. 'No parley for your kind!' a voice snarls. There's no negotiation; only battle. You engage in a brutal fight to break through their blockade, taking heavy hits. <br><br>'They came prepared!' Zephyr curses, trying to dodge fire. You force your way through, but the cost to your ship and crew is significant. The direct path to the Nebula's Heart is open, but you're limping.",
                            "shipHealthChange": -25,
                            "treasureChange": 0,
                            "crewHealthChange": -15,
                            "specialEffect": "rivalFactionEncountered",
                            "nextId": "act2_enc_hostile_patrol_check"
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "pirateReputation",
                            "comparison": "set"
                        }
                    },
                    {
                        "text": "Attempt to negotiate a smaller fee or offer a diversion, relying on Dr. Aris's quick thinking and Zephyr's evasive skills.",
                        "outcome": {
                            "image": "outcome/act2_enc3_outcome2.png",
                            "text": "You try to negotiate, but the enemy is resolute. Your attempts to bargain or evade are met with scorn. They open fire, forcing you to pay a substantial tribute to avoid a protracted fight, damaging your ship and your pride. <br><br>'A costly lesson, Captain,' Aris mutters, 'but at least we're still in one piece.' You pass through their territory, now poorer but with your objective still in sight: the deeper Wastes and the Nebula's Heart.",
                            "shipHealthChange": -15,
                            "treasureChange": -100,
                            "crewHealthChange": 0,
                            "specialEffect": "rivalFactionEncountered",
                            "nextId": "act2_enc_hostile_patrol_check"
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "reputationLossMinor",
                            "comparison": "not_set"
                        }
                    }
                ]
            },
            {
                "id": "act2_enc_ancient_ruins",
                "displayName": "Ancient Ruins Discovery",
                "image": "encounters/act2_enc_ancient_ruins.png",
                "scenario": "Your scans pick up the faint, almost imperceptible outline of ancient structures embedded within a rogue planetoid. These ruins predate known galactic civilizations and could hold incredible secrets or dangerous traps.",
                "options": [
                    {
                        "text": "Send an exploration team to cautiously investigate the ruins.",
                        "outcome": {
                            "image": "outcome/act2_enc_ancient_ruins_outcome1.png",
                            "text": "Your team navigates treacherous passageways. They discover a chamber filled with priceless alien artifacts, netting you 300 credits. <br><br>However, disturbing the ruins activates an ancient defense drone, which damages your ship before it's neutralized. <br><br>'A high price for knowledge, Captain,' Aris notes as she examines a salvaged artifact. The energy patterns within these ruins are unlike anything recorded, hinting at distortions of space-time itself. You now must navigate a strange region where time seems to warp and flow irregularly.",
                            "shipHealthChange": -10,
                            "treasureChange": 300,
                            "crewHealthChange": 0,
                            "nextId": "act2_enc_temporal_distortion"
                        }
                    },
                    {
                        "text": "Attempt a high-power scan from orbit to learn about the ruins without risking a landing.",
                        "outcome": {
                            "image": "outcome/act2_enc_ancient_ruins_outcome2.png",
                            "text": "Your long-range scans yield fascinating but inconclusive data. Dr. Aris deduces the ruins belong to a long-extinct species, but the valuable artifacts remain hidden. You gain knowledge but no material wealth. <br><br>'Frustrating,' Aris mutters, 'so much potential, lost to time.' The scans do, however, reveal unusual energy fluctuations just beyond the ruins – a strange region where time itself seems to warp and flow irregularly.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act2_enc_temporal_distortion"
                        }
                    }
                ]
            },
            {
                "id": "act2_enc_temporal_distortion",
                "displayName": "Temporal Distortion Field",
                "image": "encounters/act2_enc_temporal_distortion.png",
                "scenario": "You enter a strange region of space where time seems to warp and flow irregularly. Sensors flicker, and the crew reports disorientation. It's beautiful but dangerous.",
                "options": [
                    {
                        "text": "Proceed slowly and cautiously, attempting to navigate the distortions without disturbing them.",
                        "outcome": {
                            "image": "outcome/act2_enc_temporal_distortion_outcome1.png",
                            "text": "Zephyr guides the ship with extreme care, but the unpredictable nature of the field causes minor hull stress and disorients the crew, impacting their morale. <br><br>'Feels like we're sailing through treacle,' Jax grumbles. You eventually emerge on the other side, shaken but intact. The path ahead leads you towards a heavily armed patrol checkpoint, where your reputation will once again precede you.",
                            "shipHealthChange": -5,
                            "treasureChange": 0,
                            "crewHealthChange": -10,
                            "nextId": "act2_enc_hostile_patrol_check"
                        }
                    },
                    {
                        "text": "Attempt to exploit the distortion, hoping for a shortcut through space.",
                        "outcome": {
                            "image": "outcome/act2_enc_temporal_distortion_outcome2.png",
                            "text": "You take a dangerous gamble, pushing your ship into the heart of the distortion. For a terrifying moment, space-time twists around you, then violently snaps back. You've skipped a significant portion of your journey, but the sudden jump inflicts heavy stress on your vessel and crew, and you arrive directly at the STAR-HEART GEM's guardians.",
                            "shipHealthChange": -15,
                            "treasureChange": 0,
                            "crewHealthChange": -15,
                            "specialEffect": "skippedSegment",
                            "nextId": "act3_enc_guardian_sentinels"
                        }
                    },
                    {
                        "text": "Have Dr. Aris analyze the distortion, seeking scientific understanding.",
                        "outcome": {
                            "image": "outcome/act2_enc_temporal_distortion_outcome_temporal_data.png",
                            "text": "Dr. Aris bravely stays at her console, gathering vast amounts of complex temporal data before the field dissipates. The effort is taxing on the crew, but the insights gained into space-time manipulation could be invaluable for navigating ancient, complex energy fields. <br><br>'This changes everything we thought we knew about space-time,' Aris marvels, eyes wide. The data collected will help you understand the deeper mysteries of the Whispering Wastes as you approach the final checkpoint, manned by the Rival Faction.",
                            "shipHealthChange": 0,
                            "treasureChange": 200,
                            "crewHealthChange": -5,
                            "specialEffect": "temporalDataAcquired",
                            "nextId": "act2_enc_hostile_patrol_check"
                        }
                    }
                ]
            },
            {
                "id": "act2_enc_hostile_patrol_check",
                "displayName": "Patrol Checkpoint",
                "image": "encounters/act2_enc_hostile_patrol_check.png",
                "scenario": "A heavily armed patrol checkpoint, controlled by the Rival Faction, looms ahead. They demand identification and a detailed manifest. Your previous interactions with them will dictate their response.",
                "options": [
                    {
                        "text": "Attempt to bluff your way through the checkpoint.",
                        "outcome": {
                            "image": "outcome/act2_enc_hostile_patrol_check_outcome1.png",
                            "text": "Captain Eva's confident facade and Zephyr's clever transponder spoofing work flawlessly. The patrol waves you through, none the wiser. <br><br>'Clean as a whistle,' Zephyr winks. You pass without incident or cost, and the path to the very Heart of the Nebula is now clear.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act3_enc_nebula_heart"
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "rivalFactionEncountered",
                            "comparison": "not_set"
                        }
                    },
                    {
                        "text": "Prepare for evasive maneuvers and a potential fight.",
                        "outcome": {
                            "image": "outcome/act2_enc_hostile_patrol_check_outcome2.png",
                            "text": "Recognizing you instantly, the Rival Faction opens fire without warning. You're forced into a desperate dogfight, taking heavy hits before breaking free. You escape, but the ship is battered, and the crew is shaken. <br><br>'They don't forgive easily,' Eva sighs. You've broken through, but the battle leaves you vulnerable for the final push to the Nebula's Heart.",
                            "shipHealthChange": -25,
                            "treasureChange": 0,
                            "crewHealthChange": -10,
                            "nextId": "act3_enc_nebula_heart"
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "rivalFactionEncountered",
                            "comparison": "set"
                        }
                    },
                    {
                        "text": "Attempt to pay them off for safe passage.",
                        "outcome": {
                            "image": "outcome/act2_enc_hostile_patrol_check_outcome3.png",
                            "text": "You transmit a large sum of credits to the patrol. They accept the bribe with a curt nod and allow you to pass, albeit with a lingering sense of resentment. <br><br>'Money talks, even out here,' Jax mutters. A costly but peaceful resolution. The path to the Nebula's Heart is now open, though your coffers are lighter.",
                            "shipHealthChange": 0,
                            "treasureChange": -150,
                            "crewHealthChange": 0,
                            "nextId": "act3_enc_nebula_heart"
                        },
                        "condition": {
                            "type": "treasure",
                            "value": 150,
                            "comparison": "greaterThanOrEqual"
                        }
                    },
                    {
                        "text": "Attempt to pay them off for safe passage.",
                        "outcome": {
                            "image": "outcome/act2_enc_hostile_patrol_check_outcome_fail.png",
                            "text": "You attempt to offer a bribe, but your funds are insufficient. The patrol scoffs and opens fire, forcing you into a brutal, damaging fight. <br><br>'You've got nothing we want!' a voice roars. You are forced to fight your way through the blockade, taking heavy damage to ship and crew. A painful reminder that some debts cannot be bought off. The path to the Nebula's Heart is now open, but you're in a perilous state.",
                            "shipHealthChange": -35,
                            "treasureChange": 0,
                            "crewHealthChange": -15,
                            "nextId": "act3_enc_nebula_heart"
                        },
                        "condition": {
                            "type": "treasure",
                            "value": 150,
                            "comparison": "lessThan"
                        }
                    }
                ]
            }
        ],
        "summary": "The Whispering Wastes tested your limits. You've overcome its perils and dilemmas, drawing closer to the STAR-HEART GEM. Your final challenge awaits in the Heart of the Nebula, home to its ultimate guardians. <br><br>Prepare your crew and ship, for the trials ahead will be unlike any you've faced before. The Nebula's Heart is within reach, but it will not yield its secrets easily."
    },
    {
        "title": "Act 3: Heart of the Nebula",
        "actDescription": "You've reached the Heart of the Nebula, source of the STAR-HEART GEM's power. Ancient guardians stand between you and your prize. This is your ultimate trial.",
        "encounters": [
            {
                "id": "act3_enc_nebula_heart",
                "displayName": "The Nebula's Calming Heart",
                "image": "encounters/act3_enc_nebula_heart.png",
                "scenario": "You drift into a serene, almost silent region of the nebula. The swirling cosmic dust here emits a soft, comforting glow. Your sensors indicate unusually stable energy fields. <br><br>It feels like a moment of peace before the final push.",
                "options": [
                    {
                        "text": "Allow the crew a brief moment of respite and reflection.",
                        "outcome": {
                            "image": "outcome/act3_enc_nebula_heart_outcome1.png",
                            "text": "The quiet solitude calms frayed nerves. Your crew emerges from the brief pause refreshed and reinvigorated, ready for the challenges ahead. Eva gives a rare, small smile. <br><br>'We needed that, Captain. We're as ready as we'll ever be for what's next.' The path ahead reveals three massive, silent constructs—the ancient Guardian Sentinels.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 10,
                            "nextId": "act3_enc_guardian_sentinels"
                        }
                    },
                    {
                        "text": "Attempt to siphon the stable energy fields for a temporary ship boost.",
                        "outcome": {
                            "image": "outcome/act3_enc_nebula_heart_outcome2.png",
                            "text": "Jax carefully extends energy conduits into the stable fields. You absorb a burst of pure energy, giving your ship a temporary surge of power and minor repairs. <br><br>'Free energy, Captain! Just what we needed for the grand finale!' Jax shouts, already integrating the boost. Your ship hums with renewed vigor. Ahead, the path to the STAR-HEART GEM is blocked by three massive, silent constructs—the legendary Guardian Sentinels.",
                            "shipHealthChange": 5,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "specialEffect": "finalPowerSurge",
                            "nextId": "act3_enc_guardian_sentinels"
                        }
                    },
                    {
                        "text": "Analyze the unique energy signature for potential valuable data.",
                        "outcome": {
                            "image": "outcome/act3_enc_nebula_heart_outcome3.png",
                            "text": "Dr. Aris quickly scans the unique energy. She gathers enough data to potentially sell for 50 credits, but the delicate analysis means less focus on preparing for the next challenge. <br><br>'Fascinating... but time is a factor,' Aris murmurs, already saving the complex readouts. Your brief moment of scientific discovery done, your sensors now lock onto three massive, silent constructs directly blocking your path: the ancient Guardian Sentinels.",
                            "shipHealthChange": 0,
                            "treasureChange": 50,
                            "crewHealthChange": 0,
                            "nextId": "act3_enc1"
                        }
                    }
                ]
            },
            {
                "id": "act3_enc_guardian_sentinels",
                "displayName": "Ancient Guardian Sentinels",
                "image": "encounters/act3_enc_guardian_sentinels.png",
                "scenario": "Your path to the STAR-HEART GEM is blocked by three massive, silent constructs. They radiate an ancient, protective energy, clearly designed to repel intruders. These are the legendary Guardian Sentinels.",
                "options": [
                    {
                        "text": "Attempt a stealthy bypass, relying on Zephyr's intricate maneuvering.",
                        "outcome": {
                            "image": "outcome/act3_enc_guardian_sentinels_outcome1.png",
                            "text": "Zephyr attempts to slip past, but the sentinels' sensors are too advanced, their ancient programming unyielding. They detect your subtle movements and unleash a volley of energy blasts, forcing you to engage head-on. <br><br>'They're faster than they look, Captain!' Zephyr curses, bracing for impact. You're now in a direct confrontation with the guardians, with your ship already taking hits.",
                            "shipHealthChange": -20,
                            "treasureChange": 0,
                            "crewHealthChange": -10,
                            "nextId": "act3_enc1"
                        },
                        "condition": {
                            "type": "crewHealth",
                            "value": 70,
                            "comparison": "lessThan"
                        }
                    },
                    {
                        "text": "Attempt a stealthy bypass, relying on Zephyr's intricate maneuvering.",
                        "outcome": {
                            "image": "outcome/act3_enc_guardian_sentinels_outcome2.png",
                            "text": "Your crew, bolstered by high morale and a shared determination, executes Zephyr's complex maneuvers flawlessly. You slip past the sentinels undetected, bypassing their formidable defenses without a scratch. <br><br>'Barely a whisper,' Zephyr breathes, a hint of pride in his voice. A testament to your team's cohesion, and the path to the STAR-HEART GEM's chamber is now open.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act3_enc1"
                        },
                        "condition": {
                            "type": "crewHealth",
                            "value": 70,
                            "comparison": "greaterThanOrEqual"
                        }
                    },
                    {
                        "text": "Attempt to negotiate with the sentinels using the ancient data.",
                        "outcome": {
                            "image": "outcome/act3_enc_guardian_sentinels_outcome3.png",
                            "text": "You transmit the scientific data acquired earlier—the resonant frequencies of the crystalline leviathan, the bio-mechanical schematics, or insights into cosmic erosion. The sentinels pause, their energy signatures flickering in response. A complex data exchange occurs, and then, slowly, they power down, allowing you to pass. <br><br>'Unbelievable,' Aris whispers, 'our research has paid off magnificently!' The guardians are dormant, and the path to the STAR-HEART GEM's chamber is clear.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act3_enc1"
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "scientificDataAcquired",
                            "comparison": "set"
                        }
                    },
                    {
                        "text": "Engage the sentinels directly, focusing fire on their core reactors.",
                        "outcome": {
                            "image": "outcome/act3_enc_guardian_sentinels_outcome4.png",
                            "text": "You unleash a full assault. The sentinels are tough, returning fire with devastating accuracy. <br><br>'Their shields are holding!' Eva shouts, as alarms blare. It's a brutal, drawn-out battle that leaves your ship heavily damaged and your crew exhausted, but you eventually destroy them, clearing the path. Your ship creaks, but the way to the STAR-HEART GEM's chamber is finally open.",
                            "shipHealthChange": -40,
                            "treasureChange": 0,
                            "crewHealthChange": -15,
                            "nextId": "act3_enc1"
                        }
                    }
                ]
            },
            {
                "id": "act3_enc1",
                "displayName": "STAR-HEART GEM Chamber",
                "image": "encounters/act3_enc1.png",
                "scenario": "You've reached the suspected location of the STAR-HEART GEM. A massive, ancient alien structure looms in the void, radiating immense energy. It's protected by an energy shield.",
                "options": [
                    {
                        "text": "Have Jax meticulously reconfigure the conduits to safely disable the defenses and claim the gem.",
                        "outcome": {
                            "image": "outcome/act3_enc1_outcome1.png",
                            "text": "Jax, grumbling but focused, works with incredible precision. One by one, the conduits disengage, and the STAR-HEART GEM's protective field dissipates without incident. You claim the gem successfully and intact, a true testament to his engineering prowess. You also manage to siphon off a small amount of residual energy, slightly patching your ship's hull. <br><br>'Got it, Captain! Clean as a whistle!' Jax grins, wiping grease from his brow. But no sooner is the gem secured than the chamber begins to groan and tear itself apart!",
                            "shipHealthChange": 10,
                            "treasureChange": 500,
                            "crewHealthChange": 0,
                            "nextId": "act3_enc2"
                        }
                    },
                    {
                        "text": "Attempt to overload the central conduit, hoping to short-circuit the entire defense system.",
                        "outcome": {
                            "image": "outcome/act3_enc1_outcome2.png",
                            "text": "You attempt to overload the system, but the ancient technology resists your brute-force approach. The conduits surge violently, triggering a localized energy discharge that severely damages the surrounding chamber and your ship. You manage to grab the gem, but at a heavy cost. <br><br>'That was... less than ideal,' Eva mutters, surveying the damage. The structure around you now groans, threatening to collapse at any moment!",
                            "shipHealthChange": -30,
                            "treasureChange": 500,
                            "crewHealthChange": -10,
                            "nextId": "act3_enc2"
                        }
                    },
                    {
                        "text": "Use the unique resonant frequency discovered earlier to destabilize the shield.",
                        "outcome": {
                            "image": "outcome/act3_enc1_outcome3.png",
                            "text": "Remembering the crystalline organism's Fibonacci frequency from the nebula's depths, Zephyr modulates your shields. The ancient defense system flickers, unable to cope with the unexpected resonance, and collapses. You claim the gem with minimal effort and no damage, a true tactical triumph! <br><br>'Like a key in a lock, Captain!' Zephyr cheers. The chamber's defenses are down, but alarms are now blaring, and an emergency escape route flashes on your navigation.",
                            "shipHealthChange": 0,
                            "treasureChange": 550,
                            "crewHealthChange": 0,
                            "nextId": "act3_enc_escape_route"
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "shipShieldBoost",
                            "comparison": "set"
                        }
                    },
                    {
                        "text": "Analyze the shield's weak points before proceeding.",
                        "outcome": {
                            "image": "outcome/act3_enc1_outcome4.png",
                            "text": "Dr. Aris applies her deep analytical insight, meticulously scanning the shield's energy patterns. She identifies a single, fluctuating conduit. You target it with precision fire, disabling the shield efficiently but draining a lot of energy. <br><br>'A surgical strike,' Aris confirms, her eyes glued to the data. You secure the gem. With the shield down, the ancient structure around you begins to groan as alarms blare.",
                            "shipHealthChange": -5,
                            "treasureChange": 500,
                            "crewHealthChange": 0,
                            "nextId": "act3_enc2"
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "arisAnalyticalInsight",
                            "comparison": "set"
                        }
                    },
                    {
                        "text": "Analyze the shield's temporal distortions, seeking a bypass.",
                        "outcome": {
                            "image": "outcome/act3_enc1_outcome_temporal.png",
                            "text": "Leveraging the complex temporal data you acquired from the Whispering Wastes, Dr. Aris identifies subtle temporal distortions within the shield. By precisely manipulating your ship's temporal regulators, you create a momentary phase shift, allowing you to slip through the shield and claim the gem with remarkable ease, leaving the system largely intact. <br><br>'A ghost in the machine,' Aris marvels. The Gem is yours, almost effortlessly. With the defenses subtly bypassed, alarms blare, and an emergency escape route appears, narrow but direct.",
                            "shipHealthChange": 0,
                            "treasureChange": 600,
                            "crewHealthChange": 0,
                            "nextId": "act3_enc_escape_route"
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "temporalDataAcquired",
                            "comparison": "set"
                        }
                    }
                ]
            },
            {
                "id": "act3_enc2",
                "displayName": "Collapsing Chamber Escape",
                "image": "encounters/act3_enc2.png",
                "scenario": "As you secure the STAR-HEART GEM, the chamber begins to collapse! The ancient structure, weakened by your presence, is tearing itself apart. You need to escape immediately, but debris is falling rapidly, threatening to crush the ship.",
                "options": [
                    {
                        "text": "Zephyr attempts a desperate, high-speed evasive maneuver through the collapsing structure.",
                        "outcome": {
                            "image": "outcome/act3_enc2_outcome1.png",
                            "text": "Zephyr pushes the ship to its absolute limits, performing gravity-defying rolls and dives. Debris scrapes past your hull, sparking and groaning, but you manage to burst free of the collapsing structure just as it implodes. <br><br>'That was too close!' Zephyr yells, his hands still trembling on the controls. A truly breathtaking escape, proving Zephyr's unparalleled piloting. You've made it out, STAR-HEART GEM in hand, but a formidable, massive alien dreadnought is waiting.",
                            "shipHealthChange": -10,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act3_enc3"
                        }
                    },
                    {
                        "text": "Captain Eva orders a defensive retreat, attempting to shield the ship with remaining energy while moving slowly.",
                        "outcome": {
                            "image": "outcome/act3_enc2_outcome2.png",
                            "text": "Captain Eva activates defensive protocols, but the sheer force of the collapsing structure is overwhelming. Heavy debris rains down, severely impacting your ship's shields and hull. <br><br>'Hold steady!' Eva commands through gritted teeth. You escape, but the ship is a battered wreck, and the crew is shaken. You've made it out, STAR-HEART GEM in hand, but a formidable, massive alien dreadnought is waiting.",
                            "shipHealthChange": -35,
                            "treasureChange": 0,
                            "crewHealthChange": -5,
                            "nextId": "act3_enc3"
                        }
                    }
                ]
            },
            {
                "id": "act3_enc_escape_route",
                "displayName": "Emergency Escape Route",
                "image": "encounters/act3_enc_escape_route.png",
                "scenario": "Your efficient gem retrieval has left the chamber somewhat stable, but alarms blare. An emergency escape route, narrow but direct, flashes on your navigation. It seems less dangerous than the main path.",
                "options": [
                    {
                        "text": "Take the emergency escape route, relying on Zephyr's precision piloting.",
                        "outcome": {
                            "image": "outcome/act3_enc_escape_route_outcome1.png",
                            "text": "Zephyr expertly navigates the tight corridor, narrowly avoiding energy traps and collapsing sections. You emerge safely, having bypassed a more chaotic escape. Your ship is untouched, but the shortcut leads you to a less advantageous position for the final confrontation. <br><br>'Sneaky, Captain, very sneaky!' Zephyr whispers. You've made it out, STAR-HEART GEM in hand, but the massive alien dreadnought is waiting. Your escape route has put you in a slightly compromised, but perhaps unexpected, flanking position.",
                            "shipHealthChange": 0,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act3_enc3_flanked"
                        }
                    },
                    {
                        "text": "Stick to the main path, using your ship's full power to blast through any remaining obstacles.",
                        "outcome": {
                            "image": "outcome/act3_enc_escape_route_outcome2.png",
                            "text": "You blast your way through the crumbling chamber. While effective, the sheer force of the explosions causes some structural stress to your hull. <br><br>'No time for finesse!' Jax shouts over the roar of your weapons. You exit onto the main approach, ready for the final battle. You've made it out, STAR-HEART GEM in hand, but a formidable, massive alien dreadnought is waiting.",
                            "shipHealthChange": -10,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": "act3_enc3"
                        }
                    }
                ]
            },
            {
                "id": "act3_enc3",
                "displayName": "Dreadnought Final Battle",
                "image": "encounters/act3_enc3.png",
                "scenario": "You've made it out, STAR-HEART GEM in hand, but a formidable, massive alien dreadnought is waiting. It's clearly here for the gem, and its weapons are already charged. This is the final stand.",
                "options": [
                    {
                        "text": "Initiate a full-scale assault, focusing fire on key weak points identified by Aris, and relying on Eva's tactical commands.",
                        "outcome": {
                            "image": "outcome/act3_enc3_outcome1.png",
                            "text": "Captain Eva barks orders, directing concentrated fire at vulnerabilities Dr. Aris pinpointed. It's a brutal, drawn-out battle. Your ship takes heavy hits, and the crew fights valiantly, but you manage to cripple the dreadnought, forcing its retreat or destruction. <br><br>'Victory, Captain! But at what cost...' Eva surveys the battered bridge. A costly but decisive victory! Your epic odyssey is complete. Your legend, and your crew's fate, is now etched into the stars.",
                            "shipHealthChange": -50,
                            "treasureChange": 0,
                            "crewHealthChange": -20,
                            "nextId": null
                        }
                    },
                    {
                        "text": "Attempt a suicidal distraction maneuver, allowing Zephyr to jump to hyperspace while Jax tries to keep their shields occupied.",
                        "outcome": {
                            "image": "outcome/act3_enc3_outcome2.png",
                            "text": "With Jax drawing enemy fire and Zephyr pushing the Jump Drive beyond safe limits, you make a daring escape. The dreadnought is momentarily confused, allowing you to slip away into hyperspace. The ship sustains extreme stress damage, and Jax's makeshift diversion causes internal explosions, but you live to fight another day. <br><br>'We're out, Captain! We're actually out!' Zephyr yells with a mix of relief and terror. The STAR-HEART GEM pulses, your prize secured, but the scars of the journey remain. Your epic odyssey is complete. Your legend, and your crew's fate, is now etched into the stars.",
                            "shipHealthChange": -40,
                            "treasureChange": 0,
                            "crewHealthChange": -10,
                            "nextId": null
                        }
                    },
                    {
                        "text": "Attempt a suicidal distraction maneuver, bolstered by Jax's efficiency.",
                        "outcome": {
                            "image": "outcome/act3_enc3_outcome2_jax.png",
                            "text": "Jax's enhanced efficiency shines through. His diversion is flawless, drawing enemy fire perfectly as Zephyr executes the Jump Drive. The ship still takes stress damage, but Jax's improvements mean the internal systems weather the strain much better. <br><br>'Calculated risk, Captain, calculated risk!' Jax grins, despite the smoke. A risky but expertly executed escape! The STAR-HEART GEM pulses, your prize secured, and your legend cemented. Your epic odyssey is complete. Your legend, and your crew's fate, is now etched into the stars.",
                            "shipHealthChange": -25,
                            "treasureChange": 0,
                            "crewHealthChange": -5,
                            "nextId": null
                        },
                        "condition": {
                            "type": "specialEffect",
                            "flag": "jaxEfficiencyBoost",
                            "comparison": "set"
                        }
                    },
                    {
                        "text": "Attempt to disable their Jump Drive before engaging.",
                        "outcome": {
                            "image": "outcome/act3_enc3_outcome3.png",
                            "text": "You dedicate a significant portion of your ship's remaining power to a targeted Jump Drive disruptor. The dreadnought's engines sputter, leaving it vulnerable. You engage at close range, winning a decisive victory with less damage, but your ship feels drained. <br><br>'They're crippled! Fire at will!' Eva commands. A cleaner victory, achieved through precision. Your epic odyssey is complete. Your legend, and your crew's fate, is now etched into the stars.",
                            "shipHealthChange": -20,
                            "treasureChange": 0,
                            "crewHealthChange": 0,
                            "nextId": null
                        },
                        "condition": {
                            "type": "shipHealth",
                            "value": 70,
                            "comparison": "greaterThanOrEqual"
                        }
                    },
                    {
                        "text": "Attempt to disable their Jump Drive before engaging.",
                        "outcome": {
                            "image": "outcome/act3_enc3_outcome_fail.png",
                            "text": "You attempt the Jump Drive disruptor, but your ship lacks the power. The attempt fails, and the dreadnought retaliates with devastating fire. <br><br>'System critical, Captain!' Jax screams. You're overwhelmed. This last act of defiance costs you dearly, pushing your ship and crew to their breaking point, but the Gem is secured... barely. Your epic odyssey is complete. Your legend, and your crew's fate, is now etched into the stars.",
                            "shipHealthChange": -60,
                            "treasureChange": 0,
                            "crewHealthChange": -25,
                            "nextId": null
                        },
                        "condition": {
                            "type": "shipHealth",
                            "value": 70,
                            "comparison": "lessThan"
                        }
                    }
                ]
            },
            {
                "id": "act3_enc3_flanked",
                "displayName": "Dreadnought Flanked Battle",
                "image": "encounters/act3_enc3_flanked.png",
                "scenario": "You've made it out through the emergency route, STAR-HEART GEM in hand, but the massive alien dreadnought is waiting. Your escape route has put you in a slightly compromised, but perhaps unexpected, position.",
                "options": [
                    {
                        "text": "Initiate a surprise attack from your flanking position, targeting their less-shielded rear.",
                        "outcome": {
                            "image": "outcome/act3_enc3_flanked_outcome1.png",
                            "text": "Captain Eva barks orders, exploiting your flanking position. The dreadnought is caught off guard, taking heavy damage to its vulnerable rear. The battle is quicker and less damaging to your ship, but the enemy still retaliates fiercely. <br><br>'We hit 'em where it hurts!' Eva shouts. A decisive victory, securing the Gem and your escape. Your epic odyssey is complete. Your legend, and your crew's fate, is now etched into the stars.",
                            "shipHealthChange": -30,
                            "treasureChange": 0,
                            "crewHealthChange": -10,
                            "nextId": null
                        }
                    },
                    {
                        "text": "Attempt to negotiate for safe passage, leveraging the element of surprise.",
                        "outcome": {
                            "image": "outcome/act3_enc3_flanked_outcome2.png",
                            "text": "You hail the dreadnought, demanding safe passage. The pirate lord, startled by your sudden appearance from an unexpected angle, agrees to let you pass for a substantial sum of credits. <br><br>'Consider this a... tax,' the Pirate Lord growls. A costly but bloodless escape, the STAR-HEART GEM yours without further combat. Your epic odyssey is complete. Your legend, and your crew's fate, is now etched into the stars.",
                            "shipHealthChange": 0,
                            "treasureChange": -200,
                            "crewHealthChange": 0,
                            "nextId": null
                        },
                        "condition": {
                            "type": "treasure",
                            "value": 200,
                            "comparison": "greaterThanOrEqual"
                        }
                    },
                    {
                        "text": "Attempt to negotiate for safe passage.",
                        "outcome": {
                            "image": "outcome/act3_enc3_flanked_outcome_fail.png",
                            "text": "You attempt to negotiate, but when they learn you lack the funds, they engage, unleashing their full fury. <br><br>'Fools! You thought you could trick us?' the Pirate Lord snarls. Caught off guard, you take massive damage. This was a costly gamble, and you're left battered. <br><br>Your epic odyssey is complete. Your legend, and your crew's fate, is now etched into the stars.",
                            "shipHealthChange": -50,
                            "treasureChange": 0,
                            "crewHealthChange": -15,
                            "nextId": null
                        },
                        "condition": {
                            "type": "treasure",
                            "value": 200,
                            "comparison": "lessThan"
                        }
                    }
                ]
            }
        ],
        "summary": "The Heart of the Nebula demanded everything. You've faced its defenses and guardians, securing the Gem. Your epic odyssey is complete. Your legend, and your crew's fate, is now etched into the stars. <br><br>As you drift away, the STAR-HEART GEM pulses with a soft, warm light, a symbol of your triumph and the trials you've overcome. The crew gathers on the bridge, weary but victorious, ready to chart a new course through the cosmos."
    }
]